import os.path

TRANSLITERATION_DICT = {
    'а': 'a',
    'б': 'b',
    'в': 'v',
    'г': 'g',
    'д': 'd',
    'е': 'e',
    'ё': 'e',
    'ж': 'zh',
    'з': 'z',
    'и': 'i',
    'й': 'y',
    'к': 'k',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'о': 'o',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'u',
    'ф': 'f',
    'х': 'kh',
    'ц': 'c',
    'ч': 'ch',
    'ш': 'sh',
    'щ': 'shch',
    'ы': 'y',
    'э': 'e',
    'ю': 'yu',
    'я': 'ya'
}

TIMINGS = [f'{start}-{stop}. Перемена: {_break} минут' for start, stop, _break in
           [('10:00', '10:45', 10),
            ('10:55', '11:40', 10),
            ('11:50', '12:35', 20),
            ('12:55', '13:40', 30),
            ('14:10', '14:55', 15),
            ('15:05', '15:50', 10),
            ('16:00', '16:45', 0)]]

PHOTO_DIR = os.path.join('src', 'db', 'img')